       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBLEM006.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I          PIC 9(16).
       01 SOSQR      PIC 9(16) VALUE 0.
       01 SOSUM      PIC 9(16) VALUE 0.
       01 DISPRESULT PIC ZZZZZZZZZZZZZZZ9.

       PROCEDURE DIVISION.
         PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100
           COMPUTE SOSQR = SOSQR + I * I
           COMPUTE SOSUM = SOSUM + I
         END-PERFORM

         COMPUTE DISPRESULT = SOSUM * SOSUM - SOSQR
         DISPLAY DISPRESULT
         STOP RUN.
