       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROBLEM001.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I          PIC 9(04).
       01 DIV3       PIC 9(01).
       01 DIV5       PIC 9(01).
       01 DUMMY      PIC 9(01).
       01 RESULT     PIC 9(10) VALUE 0.
       01 DISPRESULT PIC ZZZZZZZZZ9.

       PROCEDURE DIVISION.
         PERFORM VARYING I FROM 1 BY 1 UNTIL I >= 1000
           DIVIDE I BY 3 GIVING DUMMY REMAINDER DIV3
           DIVIDE I BY 5 GIVING DUMMY REMAINDER DIV5

           IF DIV3 = 0 OR DIV5 = 0
             ADD I TO RESULT
           END-IF
         END-PERFORM

         MOVE RESULT TO DISPRESULT
         DISPLAY DISPRESULT
         STOP RUN.
